_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_MSP_НастройкаСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_MSP_НастройкаСинхронизации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранитьНастройкиВEXCEL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьEXCEL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьПоНаименованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьПоДополнительнымРеквизитам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаMSPНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрешенныеСтатусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_MSP_НастройкаСинхронизации/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ФормаИндикатор;

&НаКлиенте
Перем ПараметрыОбработчика;

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПутьEXCELНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог 				= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ФильтрДляДиалога 	= "EXCEL 2003 (*.xls)|*.xls";
	ФильтрДляДиалога 	= ФильтрДляДиалога + "|EXCEL 2007 (*.xlsx|*.xlsx@";
	ФильтрДляДиалога 	= ФильтрДляДиалога + "|Все файлы (*.*)|*.*";
	Диалог.Фильтр 		= ФильтрДляДиалога;
	
	// Синхронный вызов
	//Если Диалог.Выбрать() Тогда
	//	Объект.ПутьEXCEL = Диалог.ПолноеИмяФайла;
	//КонецЕсли;
	
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
	Диалог.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			Объект.ПутьEXCEL = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	Если Объект.СинхронизироватьПоДополнительнымРеквизитам или Объект.СинхронизироватьПоНаименованию Тогда
		СохранитьНастройки();
		ЗаполнитьНастройки();
		СоздатьРеквизитыТабличнойЧасти();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить один (или оба) из реквизитов: "+Символы.ПС+
		"Поиск по наименованию"+Символы.ПС+
		"Поиск по дополнительным реквизитам");
	КонецЕсли;															
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПолучитьФункциональнуюОпцию("СМ_ИспользоватьСтатусыДокументов") Тогда
		Элементы.ГруппаСтатусы.Видимость=Ложь;
	КонецЕсли;
	
	
	Объект.СинхронизироватьПоНаименованию = Истина;
	
	
	
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок,
		                    |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство
		                    |ИЗ
		                    |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
		                    |ГДЕ
		                    |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка В (ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ПозицияЛокальнойСметы))
		                    |
		                    |СГРУППИРОВАТЬ ПО
		                    |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Заголовок,
		                    |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство
		                    |
		                    |УПОРЯДОЧИТЬ ПО
		                    |	Заголовок");
	
	    Набор=Запрос.Выполнить().Выгрузить();
	    ФлажкиНастроек=Новый Массив;
	    Ном=1;
		
		Для Каждого Рекв Из Набор Цикл
			ИмяКолонки="Колонка"+СтрЗаменить(Ном,Символы.НПП,"");
			ЗаголовокКолонки=Рекв.Заголовок;
			
			Стр=СоответствиеКолонокДопРеквизитов.Добавить();
			Стр.ИмяКолонки=ИмяКолонки;
			Стр.Заголовок=ЗаголовокКолонки;
			Стр.Используется=Ложь;
			Стр.ЮИД=Рекв.Свойство.УникальныйИдентификатор();
			
			
			ФлажкиНастроек.Добавить(Новый РеквизитФормы("Ф"+ИмяКолонки,Новый ОписаниеТипов("Булево"),,ЗаголовокКолонки)); 
			Ном=Ном+1;
		КонецЦикла;
		ИзменитьРеквизиты(ФлажкиНастроек);
		
		Ном=1;
		Для Каждого Рекв Из Набор Цикл
			ИмяКолонки="ФКолонка"+СтрЗаменить(Ном,Символы.НПП,"");
			ЗаголовокКолонки=Рекв.Заголовок;
			НовыйФлажок=Элементы.Добавить("ГруппаДопРеквизиты"+ИмяКолонки,Тип("ПолеФормы"),Элементы.ГруппаДопРеквизиты);
			НовыйФлажок.Вид = ВидПоляФормы.ПолеФлажка; 
			НовыйФлажок.ПутьКДанным = ИмяКолонки; 
			Ном=Ном+1;
		КонецЦикла;
		
	ЗаполнитьНастройки();
	СоздатьРеквизитыТабличнойЧасти();	

		
		
	
	
	
	ЗаполнитьТаблицыПоДаннымНастройки();
	ТребуетсяСохранение=Ложь;
	Отбор=Новый Структура;
	Отбор.Вставить("ПоказыватьВСмете",-1);
	Отбор.Вставить("ПоказыватьВПроекте",-1);
	Отбор.Вставить("ТолькоНеСопоставленныеВПроекте",Ложь);
	Отбор.Вставить("ТолькоНеСопоставленныеВСмете",Ложь);
	Отбор.Вставить("ТекстПоискаПроект","");
	Отбор.Вставить("ТекстПоискаСмета","");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыТабличнойЧасти()
		
		НовыеКолонки = Новый Массив; 
		НовыеКолонкиСоответствия=новый Массив;
		
		
		Ном=1;
		
		Для Каждого Рекв Из СоответствиеКолонокДопРеквизитов Цикл
			Если Рекв.Используется Тогда
				Если  Элементы.Найти("ЗадачиПроекта"+Рекв.ИмяКолонки)=Неопределено	Тогда
					НовыеКолонки.Добавить(Новый РеквизитФормы(Рекв.ИмяКолонки,Новый ОписаниеТипов("Строка"),"ЗадачиПроекта",Рекв.Заголовок)); 
					НовыеКолонкиСоответствия.Добавить(Новый РеквизитФормы("П"+Рекв.ИмяКолонки,Новый ОписаниеТипов("Строка"),"ТаблицаСопоставлений",Рекв.Заголовок)); 
				КонецЕсли;	
			КонецЕсли;
			Ном=Ном+1;
		КонецЦикла;
		
		
		ИзменитьРеквизиты(НовыеКолонки);
		ИзменитьРеквизиты(НовыеКолонкиСоответствия);
		
		
		Для каждого Колонка Из НовыеКолонки Цикл 
			НовыйЭлемент = Элементы.Добавить("ЗадачиПроекта"+Колонка.Имя,Тип("ПолеФормы"),Элементы.ЗадачиПроекта); 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
			НовыйЭлемент.ПутьКДанным = "ЗадачиПроекта."+Колонка.Имя; 
			НовыйЭлемент.ТолькоПросмотр = Истина; 
		КонецЦикла; 	
КонецПроцедуры

// Заполняем таблицу соответствия проектов/задач/ресурсов сметным данным.
&НаСервере
Функция ЗаполнитьТаблицыПоДаннымНастройки()
	
	Настройки = Объект.Настройки;
	Область=Настройки.НайтиТекст("Проект");
	Если Область=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ИмяЯчейки     = Область.Имя;
	ДлинаИмени     = СтрДлина(ИмяЯчейки);
	ПозицияС     = Найти(ИмяЯчейки,"C");
	СтрокаЗаголовка     = Сред(ИмяЯчейки, 2, ПозицияС-2);
	ПерваяКолонка     = Сред(ИмяЯчейки, ПозицияС+1, ДлинаИмени-ПозицияС);
	
	Область=Настройки.НайтиТекст("Тип нормативного сборника");
	Если Область<>Неопределено Тогда
		ИмяЯчейки     = Область.Имя;
		ДлинаИмени     = СтрДлина(ИмяЯчейки);
		ПозицияС     = Найти(ИмяЯчейки,"C");
		ПоследняяКолонка     =Сред(ИмяЯчейки, ПозицияС+1, ДлинаИмени-ПозицияС);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Настройки.Область(СтрокаЗаголовка, ПерваяКолонка, Настройки.ВысотаТаблицы, ПоследняяКолонка));
	Построитель.Выполнить();
	ТЗ = Построитель.Результат.Выгрузить();	
	ТаблицаСопоставлений.Очистить();
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		Если Колонка.Имя="НаименованиеРаботы" Тогда Колонка.Имя="Работа"; 
		ИначеЕсли Колонка.Имя="НазваниеЗадачи" Тогда Колонка.Имя="Задача";
		ИначеЕсли Колонка.Имя="РесурсПроекта" Тогда Колонка.Имя="Ресурс";	
		ИначеЕсли Колонка.Имя="ПлановыйОбъём_Всего" Тогда Колонка.Имя="ОбъемСметы";	
		ИначеЕсли Колонка.Имя="Трудозатраты" Тогда Колонка.Имя="ОбъемПроекта";
		Иначе 
			ТЗС=ТаблицаСопоставлений.Выгрузить();
			Если ТЗС.Колонки.Найти(Колонка.Имя)=Неопределено Тогда
				ИмяДляПоиска=Колонка.Имя;
				Преф="П";
				СтрМас=СоответствиеКолонокДопРеквизитов.НайтиСтроки(Новый Структура("Заголовок",ИмяДляПоиска));
				Если СтрМас.Количество()>0 Тогда
					Колонка.Имя=Преф+СтрМас[0].ИмяКолонки;
				Конецесли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	номер=1;
	Для Каждого Эл Из ТЗ Цикл
		Стр=ТаблицаСопоставлений.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Эл);
		Стр.номер=Номер;
		Номер=Номер+1;
	КонецЦикла;
	 МаксНомер=Номер;
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройки(ЗначенияФлажков=Неопределено)  	
	СтруктураПараметров = СМ_MSP_ВызовСервера.ПрочитатьНастройкиОбменаMSP();
	ЗаполнитьЗначенияСвойств(Объект, СтруктураПараметров);	
	Если СтруктураПараметров.Свойство("Настройки") Тогда
		Объект.Настройки = СтруктураПараметров.Настройки.Получить();
		Если ЗначениеЗаполнено(Объект.ПутьEXCEL) и Объект.ХранитьНастройкиВEXCEL Тогда
			// Читаем файл EXCEL - это и будут наши настройки.
			ТабДокумент = Новый ТабличныйДокумент();
			Попытка
				ТабДокумент.Прочитать(Объект.ПутьEXCEL,СпособЧтенияЗначенийТабличногоДокумента.Текст);
				Объект.Настройки = ТабДокумент;
			Исключение
			КонецПопытки;
		КонецЕсли;
		Элементы.ПрименитьНастройки.Доступность = Ложь;
		Элементы.ДекорацияПервыйЗапуск.Видимость = Ложь;
		Элементы.ГруппаПравилаПоиска.ТолькоПросмотр = Истина;
		Элементы.ГруппаEXCEL.ТолькоПросмотр = Истина;
		Элементы.ОбработкаMSPНаКлиенте.Доступность = Ложь;
		Элементы.ГруппаСтатусы.Доступность=Ложь;

		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницыФормы.ПодчиненныеЭлементы.Редактор;
	Иначе
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницыФормы.ПодчиненныеЭлементы.Настройки;
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
		Элементы.СинхронизироватьПоДополнительнымРеквизитам.Доступность = Ложь;
	КонецЕсли;
	
	Если   СтруктураПараметров.Свойство("ДополнительныеДанные") Тогда
		Допы = СтруктураПараметров.ДополнительныеДанные.Получить();
		Если Допы.Свойство("ОбработкаMSPНаКлиенте") Тогда
			Объект.ОбработкаMSPНаКлиенте=Допы.ОбработкаMSPНаКлиенте;
		КонецЕсли;	
		Если Допы.Свойство("РазрешенныеСтатусы") Тогда
			Объект.РазрешенныеСтатусы.Очистить();
			Объект.РазрешенныеСтатусы.Загрузить(Допы.РазрешенныеСтатусы);
		КонецЕсли;
		Если Допы.Свойство("ЗначенияФлажков") Тогда
			Для Каждого Эл Из Допы.ЗначенияФлажков Цикл
				Строки=СоответствиеКолонокДопРеквизитов.НайтиСтроки(Новый Структура("ЮИД",Эл.ЮИД));
				Если  Строки.Количество()>0 Тогда
					ЭтаФорма["Ф"+Строки[0].ИмяКолонки]=Эл.Значение;
					Строки[0].Используется=Эл.Значение;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		

	КонецЕсли;	
		
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки() 
	

	Допы = Новый Структура();
	Допы.Вставить("ОбработкаMSPНаКлиенте",Объект.ОбработкаMSPНаКлиенте);
	Допы.Вставить("РазрешенныеСтатусы",Объект.РазрешенныеСтатусы.Выгрузить());
	
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЮИД");
	ТЗ.Колонки.Добавить("Значение");
	Для Каждого Эл Из СоответствиеКолонокДопРеквизитов Цикл
		Стр=ТЗ.Добавить();
		Стр.ЮИД=Эл.ЮИД;
		Стр.Значение=ЭтаФорма["Ф"+Эл.ИмяКолонки];
	КонецЦикла;
	Допы.Вставить("ЗначенияФлажков",ТЗ);
	
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("ПутьEXCEL", Объект.ПутьEXCEL);
	СтруктураПолей.Вставить("СинхронизироватьПоДополнительнымРеквизитам", Объект.СинхронизироватьПоДополнительнымРеквизитам);
	СтруктураПолей.Вставить("СинхронизироватьПоНаименованию", Объект.СинхронизироватьПоНаименованию);
	СтруктураПолей.Вставить("ХранитьНастройкиВEXCEL", Объект.ХранитьНастройкиВEXCEL);
	СтруктураПолей.Вставить("Настройки", Новый ХранилищеЗначения(Объект.Настройки));
	СтруктураПолей.Вставить("ДополнительныеДанные", Новый ХранилищеЗначения(Допы));

	

	Если СМ_MSP_ВызовСервера.ЗаписатьНастройкиОбменаMSP(СтруктураПолей) Тогда
		Элементы.ПрименитьНастройки.Доступность = Ложь;
		Элементы.ДекорацияПервыйЗапуск.Видимость = Ложь;
		Элементы.ГруппаПравилаПоиска.ТолькоПросмотр = Истина;
		Элементы.ГруппаEXCEL.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	ОткрытьФорму("Обработка.СМ_MSP_НастройкаСинхронизации.Форма.ФормаВводПутиКФайлу",Новый Структура("ОбъектСтроительства",ОБъектСтроительства),,,ВариантОткрытияОкна.ОтдельноеОкно,,Новый ОписаниеОповещения("ПослеВыбораФайлаПроекта", ЭтотОбъект, ),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаПроекта(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ<>Неопределено Тогда
		Если Ответ.Действие="Продолжить" Тогда
		ПутьКФайлуПроекта=Ответ.Путь;
		ФормаИндикатор=ОткрытьФорму("Обработка.СМ_MSP_НастройкаСинхронизации.Форма.ФормаИндикатор",Новый Структура("Текст","Загрузка данных проекта из MS Project"),ЭтаФорма,,ВариантОткрытияокна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Если Объект.ОбработкаMSPНаКлиенте Тогда
			СтруктураПолей=Новый Структура();
			СтруктураПолей.Вставить("MSP_НаименованиеОбъекта","");
			СтруктураПолей.Вставить("MSP_ЕдиницаИзмеренияРесурса","");
			СтруктураПолей.Вставить("MSP_ВидОбъекта","");
			СтруктураПолей.Вставить("MSP_GUID","");
			СтруктураПолей.Вставить("MSP_Объем","");
			СтруктураПолей.Вставить("НомерДляСопоставления","");
			СтруктураПолей.Вставить("ЕстьВложенныеЗадачи","");
			СтруктураПолей.Вставить("НомерРодителя","");
			
			Для Каждого Стр Из  СоответствиеКолонокДопРеквизитов Цикл
				СтруктураПолей.Вставить(Стр.ИмяКолонки, Стр.Заголовок);
			КонецЦикла;	
			
			МассивЗначений=Новый Массив;	
			СМ_MSP_Клиент.ПрочитатьФайлОбъекта(ОбъектСтроительства,СтруктураПолей,МассивЗначений, Объект.СинхронизироватьПоДополнительнымРеквизитам,НаименованиеПроекта,ФормаИндикатор);
		КонецЕсли;
				
			ФоновоеЗадание = Ложь;
			Если ФормаИндикатор.Открыта() Тогда
			ФормаИндикатор.Элементы.Прогресс.МаксимальноеЗначение=100;
			ФормаИндикатор.Прогресс=5;
			ФормаИндикатор.Элементы.Текст.Заголовок="Сопоставление данных MS Project и сметы";
			ФормаИндикатор.ОбновитьОтображениеДанных();
			КонецЕсли;
			ЗаполнитьСерверВФоне(МассивЗначений,ФоновоеЗадание);
			Если ФоновоеЗадание Тогда
				ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
				ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузка", 1, Истина);
				ПараметрыОбработчика.МаксимальныйИнтервал = 5;
			Иначе
				ФормаИндикатор.Закрыть();
			КонецЕсли;

	КонецЕсли;
КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузка()
	Результат = ФоновоеЗаданиеПолучитьРезультат();
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаИндикатор.Открыта() Тогда 
			ЗаверешениеФоновогоЗадания();
			ФормаИндикатор.Закрыть(); 
		КонецЕсли;
		ЭтаФорма.ОбновитьОтображениеДанных();
	Иначе
		ФормаИндикатор.Прогресс=Результат.Прогресс;
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузка", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Функция ФоновоеЗаданиеПолучитьРезультат()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.Вставить("Прогресс", 10);
	
	Ответ=ДлительныеОперации.ПрочитатьПрогресс(ФоновоеЗаданиеИдентификатор);
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда 
		Результат.Прогресс= Ответ.Процент;
	КонецЕсли;
	
	
	Результат.ФоновоеЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьСерверВФоне(МассивЗначений,ФоновоеЗадание)
	
	ВРДерево = РеквизитФормыВЗначение("ДеревоНС"); 
	ТЗ = ДанныеФормыВЗначение(ЗадачиПроекта, Тип("ДеревоЗначений"));



	Данные=новый Структура;
	Данные.Вставить("ВРДерево",ВРДерево);
	Данные.Вставить("ТЗ",ТЗ);
	Данные.Вставить("ТЗСопоставлений",ДанныеФормыВЗначение(ТаблицаСопоставлений, Тип("ТаблицаЗначений")));
	Данные.Вставить("ТЗСоотв",ДанныеФормыВЗначение(СоответствиеСтрок, Тип("ТаблицаЗначений")));
	Данные.Вставить("МассивЗначений",МассивЗначений);
	Данные.Вставить("ОбСтроительства",ОбъектСтроительства.Наименование);
	Данные.Вставить("СинхронизироватьПоДополнительнымРеквизитам",Объект.СинхронизироватьПоДополнительнымРеквизитам);
	Данные.Вставить("СоответствиеКолонокДопРеквизитов",ДанныеФормыВЗначение(СоответствиеКолонокДопРеквизитов, Тип("ТаблицаЗначений")));
	Данные.Вставить("НаименованиеПроекта",НаименованиеПроекта);
		

	
	
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Обработки.СМ_MSP_НастройкаСинхронизации.ЗаполнитьСерверВФонеСопоставление",
	Данные, 
	НСтр("ru = 'Синхронизация с MSP'"));
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
		ЗаверешениеФоновогоЗадания();
	    
	Иначе
		ФоновоеЗадание = Истина;
		ФоновоеЗаданиеИдентификатор  = РезультатФоновогоЗадания.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура ЗаверешениеФоновогоЗадания()
		Данные = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		ЗначениеВРеквизитФормы(Данные.ВРДерево, "ДеревоНС");
		ЗначениеВДанныеФормы(Данные.ТЗ, ЗадачиПроекта);
		ЗначениеВДанныеФормы(Данные.ТЗСопоставлений, ТаблицаСопоставлений);
		ЗначениеВДанныеФормы(Данные.ТЗСоотв, СоответствиеСтрок);
		УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСоответствие(Команда)
	
	Если Элементы.ЗадачиПроекта.ТекущаяСтрока<>Неопределено и Элементы.ДеревоНС.ТекущаяСтрока<>Неопределено Тогда
		Ответ=Неопределено;
		МассивПроект=Новый Массив;
		МассивСмета=Новый Массив;
		Для Каждого Эл Из   Элементы.ЗадачиПроекта.ВыделенныеСтроки Цикл
			МассивПроект.Добавить(Эл);
		КонецЦикла;
		Для Каждого Эл Из   Элементы.ДеревоНС.ВыделенныеСтроки Цикл
			МассивСмета.Добавить(Эл);
		КонецЦикла;
		
		МассивПроект=Элементы.ЗадачиПроекта.ВыделенныеСтроки;
		ДобавитьСоответствиеНаСервере(МассивПроект,МассивСмета,Ответ);
		Для Каждого Эл Из Ответ Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Эл);
		КонецЦикла;
		ТребуетсяСохранение=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСоответствиеНаСервере(СтрокиПроекта,СтрокиСметы,Ответ)
	
	ТЗСоотв=ДанныеФормыВЗначение(СоответствиеСтрок, Тип("ТаблицаЗначений"));
	
	МассивОшибок=Новый Массив;
	Для Каждого ТекПроект Из  СтрокиПроекта Цикл
		Для Каждого ТекСметы Из  СтрокиСметы Цикл
			Ответ=Неопределено;
			Проект=ЗадачиПроекта.НайтиПоИдентификатору(ТекПроект);	
			Смета=ДеревоНС.НайтиПоИдентификатору(ТекСметы);	 
			Если Проект.ЕстьВложенныеЗадачи ИЛИ Смета.ЕстьВложенныеЗадачи  ИЛИ Проект.MSP_ВидОбъекта<>"Ресурс" Тогда
				Ответ="Соответствие не назначается для набора задач!"+Проект.MSP_НаименованиеОбъекта;
			КонецЕсли;
			
			Если Ответ<>Неопределено Тогда
				МассивОшибок.Добавить(Ответ);
				Продолжить;
			КонецЕсли;
			Смета.ВСоответствии=Истина;
			Проект.ВСоответствии=Истина;
			СтрСоотв=ТЗСоотв.Добавить();
			СтрСоотв.НомерВПроекте=Проект.НомерДляСопоставления;
			СтрСоотв.НомерВНС=Смета.НомерДляСопоставления;
			СтрСоотв.Новое=Истина;
			СтрСоотв.НомерСтрокиСопоставления=МаксНомер;
			МаксНомер=МаксНомер+1;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(ТЗСоотв, СоответствиеСтрок);
	Ответ=МассивОшибок;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСоответствие(Команда)
	
	Если Элементы.ЗадачиПроекта.ТекущаяСтрока<>Неопределено и Элементы.ДеревоНС.ТекущаяСтрока<>Неопределено Тогда
		МассивПроект=Новый Массив;
		МассивСмета=Новый Массив;
		Для Каждого Эл Из   Элементы.ЗадачиПроекта.ВыделенныеСтроки Цикл
			МассивПроект.Добавить(Эл);
		КонецЦикла;
		Для Каждого Эл Из   Элементы.ДеревоНС.ВыделенныеСтроки Цикл
			МассивСмета.Добавить(Эл);
		КонецЦикла;
		
		УдалитьСоответствиеНаСервере(МассивПроект,МассивСмета);
		ТребуетсяСохранение=Истина;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УдалитьСоответствиеНаСервере(СтрокиПроекта,СтрокиСметы)
	
	ТЗСоотв=ДанныеФормыВЗначение(СоответствиеСтрок, Тип("ТаблицаЗначений"));
	ТЗСопоставл=ДанныеФормыВЗначение(ТаблицаСопоставлений, Тип("ТаблицаЗначений"));
	
	
	Для Каждого ТекПроект Из  СтрокиПроекта Цикл
		Для Каждого ТекСметы Из  СтрокиСметы Цикл
			Проект=ЗадачиПроекта.НайтиПоИдентификатору(ТекПроект);	
			Смета=ДеревоНС.НайтиПоИдентификатору(ТекСметы);	
			
			Мас=ТЗСоотв.НайтиСтроки(новый Структура("НомерВПроекте,НомерВНС",Проект.НомерДляСопоставления,Смета.НомерДляСопоставления));
			Для Каждого Эл Из Мас Цикл
					МасСоп=ТЗСопоставл.НайтиСтроки(новый Структура("Номер",Эл.НомерСтрокиСопоставления));
					Для Каждого ЭлСоп Из МасСоп Цикл
						ТЗСопоставл.Удалить(ЭлСоп);
					КонецЦикла;
					
				
				ТЗСоотв.Удалить(Эл);
			КонецЦикла;
			Мас=ТЗСоотв.НайтиСтроки(новый Структура("НомерВПроекте",Проект.НомерДляСопоставления));
			Если Мас.Количество()=0 Тогда
				Проект.ВСоответствии=Ложь;
			КонецЕсли;
			Мас=ТЗСоотв.НайтиСтроки(новый Структура("НомерВНС",Смета.НомерДляСопоставления));
			Если Мас.Количество()=0 Тогда
				Смета.ВСоответствии=Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(ТЗСоотв, СоответствиеСтрок);
	ЗначениеВДанныеФормы(ТЗСопоставл,ТаблицаСопоставлений);

	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура СоздатьТаблицу(ТЗ,Источник)
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.СМ_НормативныеСборники"));
	МассивТипов.Добавить(Тип("Строка"));
	
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , );
	
	Для Каждого Колонка Из Источник.Колонки Цикл
		ТЗ.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	ТЗ.Колонки.Добавить("Родитель",ДопустимыеТипы);    
	ТЗ.Колонки.Добавить("НаименованиеРодителя",Новый ОписаниеТипов("Строка")); 
КонецПроцедуры

&НаСервере
Процедура СохранитьСоответствиеНаСервере()
	ВТДеревоСмет = РеквизитФормыВЗначение("ДеревоНС");
	ВТДеревоПроекта = РеквизитФормыВЗначение("ЗадачиПроекта");
	ВТСоотв=РеквизитФормыВЗначение("СоответствиеКолонокДопРеквизитов");
	ТаблицаСоотв = РеквизитФормыВЗначение("СоответствиеСтрок");
	
	
	
	
	
	
	ТаблицаСметы = Новый ТаблицаЗначений;
	СоздатьТаблицу(ТаблицаСметы,ВТДеревоСмет);
	ЗаполнитьТаблицуПоДереву(ВТДеревоСмет, ТаблицаСметы, Неопределено,Ложь,"");
	
	
	ТаблицаПроекта = Новый ТаблицаЗначений;
	СоздатьТаблицу(ТаблицаПроекта,ВТДеревоПроекта);
	ЗаполнитьТаблицуПоДереву(ВТДеревоПроекта, ТаблицаПроекта, Неопределено,Истина,"");
	
	ОбСтроительста=ОбъектСтроительства.Наименование;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ Проект ИЗ &Проект КАК Проект; 
	|ВЫБРАТЬ * ПОМЕСТИТЬ Смета ИЗ &Смета КАК Смета;  ВЫБРАТЬ * ПОМЕСТИТЬ Соотв ИЗ &Соотв КАК Соотв;
	| ВЫБРАТЬ  Соотв.*,Проект.*,Смета.*,
	| ЕСТЬNULL(Смета.Шифр,"""")  КАК КодРаботы
	|ИЗ Соотв КАК Соотв ВНУТРЕННЕЕ СОЕДИНЕНИЕ Проект КАК Проект  ПО Проект.НомерДляСопоставления=Соотв.НомерВПроекте  
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Смета КАК Смета ПО Соотв.НомерВНС=Смета.НомерДляСопоставления ГДЕ  Соотв.Новое=Истина
	| УПОРЯДОЧИТЬ ПО Проект.НомерДляСопоставления";
	
	Запрос.УстановитьПараметр("Проект",ТаблицаПроекта);			
	Запрос.УстановитьПараметр("Смета",ТаблицаСметы);
	Запрос.УстановитьПараметр("Соотв",ТаблицаСоотв);
	Результат=Запрос.Выполнить().Выгрузить();
	
	
	Для Каждого Эл Из Результат Цикл
		
		Стр=Новый Структура;
		
		
		Если ВыгружатьОбъектСтроительстваТолькоДляНовых Тогда
			Стр.Вставить("Проект",НаименованиеПроекта);
			Стр.Вставить("ОбъектСтроительства",ОбСтроительста);
		КонецЕсли;
		
		Для Каждого КолДоп Из ВТСоотв Цикл
			Стр.Вставить("П"+КолДоп.ИмяКолонки,Эл[КолДоп.ИмяКолонки]);
		КонецЦикла;			
		Стр.Вставить("РесурсЕд",Эл.MSP_ЕдиницаИзмеренияРесурса);
		
		Стр.Вставить("ОбъемПроекта",СтрЗаменить(Строка(Эл.MSP_Объем),Символы.НПП,""));
		Стр.Вставить("ТипНормативногоСборника",Строка(Эл.ТипНормативногоСборника));
		
		Если   Эл.MSP_ВидОбъекта="Ресурс" Тогда
			Стр.Вставить("КодРаботы",Эл.КодРаботы);
			Стр.Вставить("Работа",Эл.Наименование);
			Стр.Вставить("Задача",Эл.Родитель);
			Стр.Вставить("Ресурс",Эл.MSP_НаименованиеОбъекта);
		Иначе
			Стр.Вставить("КодРаботы",Эл.КодРаботы);
			Стр.Вставить("Работа",Эл.Наименование);
			Стр.Вставить("Задача",Эл.MSP_НаименованиеОбъекта);
			
		КонецЕсли;
		
		Стр.Вставить("ОбъемСметы",СтрЗаменить(Строка(Эл.Объем),Символы.НПП,""));
		Если ТаблицаСопоставлений.НайтиСтроки(Стр).Количество()=0 Тогда
			СтрТаб=ТаблицаСопоставлений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТаб,Стр);
		КонецЕсли;
	КонецЦикла;
	
	// заполнение табличного документа	
	ТД = Новый ТабличныйДокумент;
	ТД.РазмерСтраницы="Custom";
	ТД.АвтоМасштаб=Ложь;
	
	// заголовок
	Макет=РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	Область=Макет.ПолучитьОбласть("Область1");
	ТД.Присоединить(Область);
	Область=Макет.ПолучитьОбласть("ОбластьДоп");
	Для Каждого КолДоп Из ВТСоотв Цикл
		Область.Параметры.Значение=КолДоп.Заголовок;
		ТД.Присоединить(Область);
	КонецЦикла;
	Область=Макет.ПолучитьОбласть("Область2");
	ТД.Присоединить(Область);
	Область=Макет.ПолучитьОбласть("Область3");
	ТД.Присоединить(Область);
	// таблица	
	Ном=1;
	Для Каждого Эл Из ТаблицаСопоставлений Цикл
		Область=Макет.ПолучитьОбласть("Область6");
		Область.Параметры.Ном=Ном;
		Область.Параметры.Проект=Эл.Проект;
		ТД.Вывести(Область);
		Область=Макет.ПолучитьОбласть("Область7");
		Для Каждого КолДоп Из ВТСоотв Цикл
			Область.Параметры.Значение="";
			Область.Параметры.Значение=Эл["П"+КолДоп.ИмяКолонки];
			ТД.Присоединить(Область);
		КонецЦикла;			
		
		Область=Макет.ПолучитьОбласть("Область8");
		ЗаполнитьЗначенияСвойств(Область.Параметры,Эл);
		ТД.Присоединить(Область);
		
		Область=Макет.ПолучитьОбласть("Область10");
		ЗаполнитьЗначенияСвойств(Область.Параметры,Эл);
		ТД.Присоединить(Область);
		Ном=Ном+1;
	КонецЦикла;
	
	Объект.Настройки.Очистить();
	Объект.Настройки.Вывести(ТД);
	Объект.Настройки.Записать(Объект.ПутьEXCEL,ТипФайлаТабличногоДокумента.XLS);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоДереву(ВТДерево, ВТТаблица, ТабРодитель,ЭтоПроект=Истина,НаименованиеРодителя="")
	Для Каждого Стр Из ВТДерево.Строки Цикл
		Если Стр.ВСоответствии Тогда
			НоваяСтрока = ВТТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока ,Стр);
			НоваяСтрока.Родитель=ТабРодитель;
			НоваяСтрока.НаименованиеРодителя=НаименованиеРодителя;
		КонецЕсли;
		Если Стр.Строки.Количество()>0 Тогда
			Если ЭтоПроект тогда
				ЗаполнитьТаблицуПоДереву(Стр, ВТТаблица, Стр.MSP_НаименованиеОбъекта,ЭтоПроект,Стр.MSP_НаименованиеОбъекта);
			Иначе
				ЗаполнитьТаблицуПоДереву(Стр, ВТТаблица, Стр.Ссылка,ЭтоПроект,Стр.Наименование);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСоответствие(Команда)
	СохранитьСоответствиеНаСервере();
	ТребуетсяСохранение=Ложь;
КонецПроцедуры

&НаСервере
Процедура ПроверитьУзлы(НеВыводитьСтроку,ТЗ,МасСтр,НаименованиеПоля)
	Для Каждого Эл Из МасСтр Цикл
		Если ТЗ.НайтиСтроки(Новый Структура(НаименованиеПоля,Эл.НомерДляСопоставления)).Количество()=0 Тогда
			НеВыводитьСтроку=Ложь;
			Возврат;
		Конецесли;
		ПроверитьУзлы(НеВыводитьСтроку,ТЗ,Эл.Строки,НаименованиеПоля);
		Если НеВыводитьСтроку=Ложь Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НайтиВДереве(Дерево,СписокДляВывода,СтрокаПоиска,Колонки)
	Для Каждого Эл Из Дерево.Строки Цикл
		Для Каждого Кол Из Колонки Цикл
			Если  Кол.Имя="Ссылка" Тогда Продолжить; Конецесли;
			Если Найти(НРег(Строка(Эл[Кол.Имя])),СтрокаПоиска)>0 Тогда
				СписокДляВывода.Добавить(Эл.НомерДляСопоставления);
				РодительЭл=Эл.Родитель;
				Пока ЗначениеЗаполнено(РодительЭл) Цикл
					СписокДляВывода.Добавить(РодительЭл.НомерДляСопоставления);
					РодительЭл=РодительЭл.Родитель;
				КонецЦикла;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		НайтиВДереве(Эл,СписокДляВывода,СтрокаПоиска,Колонки);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	// папки с задачами
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(229,229,229));
	Для Каждого Колонка ИЗ Элементы.ЗадачиПроекта.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.ЕстьВложенныеЗадачи");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(229,229,229));
	Для Каждого Колонка ИЗ Элементы.ДеревоНС.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНС.ЕстьВложенныеЗадачи");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	// есть сопоставление
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(193, 251, 102));
	Для Каждого Колонка ИЗ Элементы.ЗадачиПроекта.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.ВСоответствии");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(193, 251, 102));
	Для Каждого Колонка ИЗ Элементы.ДеревоНС.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;
	ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНС.ВСоответствии");				 
	ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУсловия.Использование  = Истина;
	
	Если Отбор.ТолькоНеСопоставленныеВПроекте Тогда
		ТЗ = РеквизитФормыВЗначение("СоответствиеСтрок");
		ВТДерево = РеквизитФормыВЗначение("ЗадачиПроекта");
		СписокСсылок=Новый СписокЗначений;
		ТЗ.Свернуть("НомерВПроекте");
		
		Для Каждого Стр Из ТЗ Цикл
			МасСтр=ВТДерево.Строки.НайтиСтроки(Новый Структура("НомерДляСопоставления",Стр.НомерВПроекте),Истина);
			
			НеВыводитьСтроку=Истина;
			ПроверитьУзлы(НеВыводитьСтроку,ТЗ,МасСтр,"НомерВПроекте");
			Если НеВыводитьСтроку Тогда
				
				СписокСсылок.Добавить(Стр.НомерВПроекте);
			КонецЕсли;
		КонецЦикла;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость",Ложь);
		Для Каждого Колонка ИЗ Элементы.ЗадачиПроекта.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.НомерДляСопоставления");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементУсловия.ПравоеЗначение = СписокСсылок;
		ЭлементУсловия.Использование  = Истина;
		
	ИначеЕсли Отбор.ПоказыватьВСмете>0 Тогда
		ТЗ = РеквизитФормыВЗначение("СоответствиеСтрок");
		ВТДеревоСмет = РеквизитФормыВЗначение("ДеревоНС");
		Проект=ЗадачиПроекта.НайтиПоИдентификатору(Отбор.ПоказыватьВСмете);
		МасТЗ=ТЗ.НайтиСтроки(Новый Структура("НомерВПроекте",Проект.НомерДляСопоставления));
		СписокСсылок=Новый СписокЗначений;
		Для Каждого Стр Из МасТЗ Цикл
			МасСтр=ВТДеревоСмет.Строки.НайтиСтроки(Новый Структура("НомерДляСопоставления",Стр.НомерВНС),Истина);
			Для Каждого Эл Из МасСтр Цикл
				СписокСсылок.Добавить(Эл.НомерДляСопоставления);
				РодительЭл=Эл.Родитель;
				Пока ЗначениеЗаполнено(РодительЭл) Цикл
					СписокСсылок.Добавить(РодительЭл.НомерДляСопоставления);
					РодительЭл=РодительЭл.Родитель;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость",Ложь);
		Для Каждого Колонка ИЗ Элементы.ДеревоНС.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНС.НомерДляСопоставления");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементУсловия.ПравоеЗначение = СписокСсылок;
		ЭлементУсловия.Использование  = Истина;
		
	ИначеЕсли СтрДлина(Отбор.ТекстПоискаСмета)>0 Тогда	
		ВТДерево = РеквизитФормыВЗначение("ДеревоНС");
		СписокСсылок=Новый СписокЗначений;
		
		НайтиВДереве(ВТДерево ,СписокСсылок,НРег(Отбор.ТекстПоискаСмета),ВТДерево.Колонки);
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость",Ложь);
		Для Каждого Колонка ИЗ Элементы.ДеревоНС.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНС.НомерДляСопоставления");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементУсловия.ПравоеЗначение = СписокСсылок;
		ЭлементУсловия.Использование  = Истина;
	КонецЕсли;
	
	Если Отбор.ТолькоНеСопоставленныеВСмете Тогда
		ТЗ = РеквизитФормыВЗначение("СоответствиеСтрок");
		ВТДерево = РеквизитФормыВЗначение("ДеревоНС");
		СписокСсылок=Новый СписокЗначений;
		ТЗ.Свернуть("НомерВНС");
		
		Для Каждого Стр Из ТЗ Цикл
			МасСтр=ВТДерево.Строки.НайтиСтроки(Новый Структура("НомерДляСопоставления",Стр.НомерВНС),Истина);
			
			НеВыводитьСтроку=Истина;
			ПроверитьУзлы(НеВыводитьСтроку,ТЗ,МасСтр,"НомерВНС");
			Если НеВыводитьСтроку Тогда
				
				СписокСсылок.Добавить(Стр.НомерВНС);
			КонецЕсли;
		КонецЦикла;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость",Ложь);
		Для Каждого Колонка ИЗ Элементы.ДеревоНС.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНС.НомерДляСопоставления");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементУсловия.ПравоеЗначение = СписокСсылок;
		ЭлементУсловия.Использование  = Истина;
	ИначеЕсли Отбор.ПоказыватьВПроекте>0 Тогда
		ТЗ = РеквизитФормыВЗначение("СоответствиеСтрок");
		ВТДеревоСмет = РеквизитФормыВЗначение("ЗадачиПроекта");
		Смета=ДеревоНС.НайтиПоИдентификатору(Отбор.ПоказыватьВПроекте);
		МасТЗ=ТЗ.НайтиСтроки(Новый Структура("НомерВНС",Смета.НомерДляСопоставления));
		СписокСсылок=Новый СписокЗначений;
		Для Каждого Стр Из МасТЗ Цикл
			МасСтр=ВТДеревоСмет.Строки.НайтиСтроки(Новый Структура("НомерДляСопоставления",Стр.НомерВПроекте),Истина);
			
			Для Каждого Эл Из МасСтр Цикл
				СписокСсылок.Добавить(Эл.НомерДляСопоставления);
				РодительЭл=Эл.Родитель;
				Пока ЗначениеЗаполнено(РодительЭл) Цикл
					СписокСсылок.Добавить(РодительЭл.НомерДляСопоставления);
					РодительЭл=РодительЭл.Родитель;
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость",Ложь);
		Для Каждого Колонка ИЗ Элементы.ЗадачиПроекта.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.НомерДляСопоставления");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементУсловия.ПравоеЗначение = СписокСсылок;
		ЭлементУсловия.Использование  = Истина;
	ИначеЕсли СтрДлина(Отбор.ТекстПоискаПроект)>0 Тогда	
		ВТДерево = РеквизитФормыВЗначение("ЗадачиПроекта");
		СписокСсылок=Новый СписокЗначений;
		
		НайтиВДереве(ВТДерево ,СписокСсылок,НРег(Отбор.ТекстПоискаПроект),ВТДерево.Колонки);
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость",Ложь);
		Для Каждого Колонка ИЗ Элементы.ЗадачиПроекта.ПодчиненныеЭлементы Цикл
			ОформляемоеПоле      = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
		КонецЦикла;
		ЭлементУсловия                = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗадачиПроекта.НомерДляСопоставления");				 
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементУсловия.ПравоеЗначение = СписокСсылок;
		ЭлементУсловия.Использование  = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ТребуетсяСохранение Тогда
		ТребуетсяСохранение=Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьПередЗакрытием", ЭтаФорма, Параметры),"Настройки сопоставления были изменены. Сохранить?",РежимДиалогаВопрос.ДаНет);
		Отказ=истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПередЗакрытием(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьСоответствиеНаСервере();
	КонецЕсли;	
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВПроекте(Команда)
	Если Элементы.ДеревоНС.ТекущаяСтрока<>Неопределено Тогда
		Отбор.ПоказыватьВПроекте=Элементы.ДеревоНС.ТекущаяСтрока;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура НеСопоставленныеВПроекте(Команда)
	Отбор.ТолькоНеСопоставленныеВПроекте=Истина;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискВПроекте(Команда)
	Отбор.ПоказыватьВПроекте=-1;
	Отбор.ТолькоНеСопоставленныеВПроекте=Ложь;
	Отбор.ТекстПоискаПроект="";
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоляПроектПриИзменении(Элемент)
	Отбор.ПоказыватьВПроекте=-1;
	Отбор.ТолькоНеСопоставленныеВПроекте=Ложь;
	Отбор.ТекстПоискаПроект=СокрЛП(ПоискПоляПроект);
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВСмете(Команда)
	Если Элементы.ЗадачиПроекта.ТекущаяСтрока<>Неопределено Тогда
		Отбор.ПоказыватьВСмете=Элементы.ЗадачиПроекта.ТекущаяСтрока;
	КонецЕсли;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура НеСопоставленныеВСмете(Команда)
	Отбор.ТолькоНеСопоставленныеВСмете=Истина;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискВСмете(Команда)
	Отбор.ПоказыватьВСмете=-1;
	Отбор.ТолькоНеСопоставленныеВСмете=Ложь;
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоляСметаПриИзменении(Элемент)
	Отбор.ПоказыватьВСмете=-1;
	Отбор.ТолькоНеСопоставленныеВСмете=Ложь;
	Отбор.ТекстПоискаСмета=СокрЛП(ПоискПоляСмета);
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьНС(Команда)
	 ЭлементыДерева = ДеревоНС.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ДеревоНС.Развернуть(ЭлементДерева.ПолучитьИдентификатор(),Истина);
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьНС(Команда)
	ЭлементыДерева = ДеревоНС.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ДеревоНС.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьMSP(Команда)
	 ЭлементыДерева = ЗадачиПроекта.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ЗадачиПроекта.Развернуть(ЭлементДерева.ПолучитьИдентификатор(),Истина);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СвернутьMSP(Команда)
		ЭлементыДерева = ЗадачиПроекта.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ЗадачиПроекта.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоНСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.ДеревоНС.ТекущиеДанные<>Неопределено Тогда
		СтандартнаяОбработка=Ложь;
		ТекСтр=Элементы.ДеревоНС.ТекущиеДанные.Ссылка;
		Если ТипЗнч(ТекСтр)=Тип("СправочникСсылка.СМ_НормативныеСборники") Тогда 
			ОткрытьФорму("Справочник.СМ_НормативныеСборники.Форма.ФормаЭлементаУправляемая",Новый Структура("Ключ",ТекСтр));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
